app/controllers/zombies_controller.rb

  def index
    @zombies = Zombie.all
---
SELECT "zombies".* FROM "zombies"

  def create
    @zombie = Zombie.new(zombie_params)

    respond_to do |format|
      if @zombie.save
---
INSERT INTO "zombies" ("age", "bio", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["age", 28], ["bio", "super cool"], ["created_at", "2015-04-12 23:13:28.495673"], ["name", "cece"], ["updated_at", "2015-04-12 23:13:28.495673"]]

  def update
    respond_to do |format|
      if @zombie.update(zombie_params)
---
UPDATE "zombies" SET "email" = ?, "rotting" = ?, "updated_at" = ? WHERE "zombies"."id" = 1  [["email", "cece@example.com"], ["rotting", "t"], ["updated_at", "2015-04-13 02:33:08.822864"]]

  def destroy
    @zombie.destroy
---
DELETE FROM "zombies" WHERE "zombies"."id" = ?  [["id", 4]]

    def set_zombie
      @zombie = Zombie.find(params[:id])
---
SELECT  "zombies".* FROM "zombies"  WHERE "zombies"."id" = ? LIMIT 1  [["id", 4]]